var status = 0;
var item = 
Array(
			Array(2040001,800,1), //头盔防御卷轴60
			Array(2040002,800,1), //10
			Array(2040008,800,1), //啊基里斯70
			Array(2040009,800,1), //啊基50
			Array(2040010,800,1), //突进70
			Array(2040011,600,1), //突进50
			Array(2040012,600,1), //泰山70
			Array(2040013,600,1), //泰山50
			Array(2040014,700,1), //进斗气70
			Array(2040015,800,1), //进斗气50 
			Array(2040016,800,1), //轻舞70
			Array(2040017,800,1), //轻舞50
			Array(2040018,800,1), //连环破70
			Array(2040019,800,1), //连环破50
			Array(2040100,800,1), //寒冰70
			
			Array(2040101,800,1), //寒冰50
			Array(2040102,800,1), //葵花70
			Array(2040103,800,1), //葵花50
			Array(2040104,800,1), //圣阴剑70
			Array(2040105,800,1), //圣锤子70
			Array(2040106,800,1), //圣域70
			Array(2040108,800,1), //圣域50


                        Array(2040109,800,1), //恶龙70
			Array(2040200,800,1), //恶龙50
			Array(2040201,800,1), //法反70
			Array(2040203,800,1), //法反50
			Array(2040206,800,1), //创70
			Array(2040301,800,1), //创50
			Array(2040302,800,1), //终极70
			Array(2040303,600,1), //中级50
			Array(2040305,600,1), //连环破70
			Array(2040306,800,1), //50
			Array(2040308,800,1), //连环闪70
			Array(2040310,800,1), //50
			Array(2040402,800,1), //圣盾70
			Array(2040404,800,1), //50
			Array(2044024,800,1), //火球70
			Array(2044014,800,1), //50
			Array(2041308,800,1), //冰兽70
			Array(2041311,800,1), //50
			Array(2041310,800,1), //落星70
			Array(2041306,800,1), //50
			Array(2041307,800,1), //冰球70
			Array(2041304,800,1), //冰球50
			Array(2041305,800,1), //火兽70
			Array(2041302,800,1), //50
			Array(2041303,800,1), //冰破70
			Array(2041300,800,1), //50
			Array(2041301,600,1), //圣光70
			Array(2044102,600,1), //50
			Array(2044101,800,1), // 光芒飞溅70
			Array(2041022,800,1), //50
			Array(2041023,500,1), //火眼70
			Array(2041020,500,1), //50
			Array(2041016,900,1), //飞龙70
			Array(2041017,900,1), //50
			Array(2041014,800,1), //神尖70
			Array(2041019,800,1), //50
			Array(2041013,800,1), //击退70
			Array(2041010,800,1), //50
			Array(2041011,600,1), //暴风雨70
			Array(2041004,300,1), //暴风雨50
			Array(2041005,800,1), //火凤凰70
			Array(2041007,800,1), //50
			Array(2041008,800,1), //集中70
			Array(2041001,800,1), //50
			Array(2041002,500,1), //神努手70
			Array(2044301,800,1), //50
			Array(2044302,800,1), //刺眼70
			Array(2041202,800,1), //50
			Array(2041201,800,1), //穿透70
			Array(2041207,800,1), //50
			Array(2041206,800,1), //冰鹰70
			Array(2044201,800,1), //50
			Array(2044202,800,1), //一己70
			Array(2044212,800,1), //50
			Array(2044214,800,1), //假动作70
			Array(2043001,800,1), //50
			Array(2043002,800,1), //拳套攻击诅咒卷轴30
			Array(2043009,800,1), //拳套攻击诅咒卷轴30
			Array(2043017,800,1), //拳套攻击诅咒卷轴30
			Array(2048001,800,1), //拳套攻击诅咒卷轴30
			Array(2040933,800,1), //拳套攻击诅咒卷轴30
			Array(2040931,800,1), //拳套攻击诅咒卷轴30
			Array(2040928,800,1), //拳套攻击诅咒卷轴30
			Array(2040927,800,1), //拳套攻击诅咒卷轴30
			Array(2040925,800,1), //拳套攻击诅咒卷轴30
			Array(2040924,800,1), //拳套攻击诅咒卷轴30
			Array(2040920,800,1), //拳套攻击诅咒卷轴30
			Array(2040915,800,1), //拳套攻击诅咒卷轴30
			Array(2040914,800,1), //拳套攻击诅咒卷轴30
			Array(2040902,800,1), //拳套攻击诅咒卷轴30
			Array(2040901,800,1), //拳套攻击诅咒卷轴30
			Array(2043002,800,1), //拳套攻击诅咒卷轴30
			Array(2043009,800,1), //拳套攻击诅咒卷轴30
			Array(2043017,800,1), //拳套攻击诅咒卷轴30
			Array(2048001,800,1), //拳套攻击诅咒卷轴30
			Array(2040933,800,1), //拳套攻击诅咒卷轴30
			Array(2040801,800,1), //拳套攻击诅咒卷轴30
			Array(2040816,800,1), //拳套攻击诅咒卷轴30
			Array(2040805,800,1), //拳套攻击诅咒卷轴30
			Array(2040802,800,1), //拳套攻击诅咒卷轴30
			Array(2040824,800,1), //拳套攻击诅咒卷轴30
			Array(2040825,800,1), //拳套攻击诅咒卷轴30
			Array(2046012,800,1), //拳套攻击诅咒卷轴30
			Array(2044909,800,1), //拳套攻击诅咒卷轴30
			Array(2040513,800,1), //拳套攻击诅咒卷轴30
			Array(2040514,800,1), //拳套攻击诅咒卷轴30
			Array(2040516,800,1), //拳套攻击诅咒卷轴30
			Array(2040517,800,1), //拳套攻击诅咒卷轴30
			Array(2040534,800,1), //拳套攻击诅咒卷轴30
			Array(2040532,800,1), //拳套攻击诅咒卷轴30
			Array(2049100,800,1), //拳套攻击诅咒卷轴30
			Array(2040501,800,1), //拳套攻击诅咒卷轴30
			Array(2040502,800,1), //拳套攻击诅咒卷轴30
			Array(2040504,800,1), //拳套攻击诅咒卷轴30
			Array(2049143,800,1), //拳套攻击诅咒卷轴30
			Array(2044902,800,1), //拳套攻击诅咒卷轴30
			Array(2044901,800,1), //拳套攻击诅咒卷轴30
			Array(2040413,800,1), //拳套攻击诅咒卷轴30
			Array(2040412,800,1), //拳套攻击诅咒卷轴30
			Array(2044807,800,1), //拳套攻击诅咒卷轴30
			Array(2044809,800,1), //拳套攻击诅咒卷轴30
			Array(2040418,800,1), //拳套攻击诅咒卷轴30
			Array(2043009,800,1), //拳套攻击诅咒卷轴30
			Array(2040425,800,1), //拳套攻击诅咒卷轴30
			Array(2040427,800,1), //拳套攻击诅咒卷轴30
			Array(2040421,800,1), //拳套攻击诅咒卷轴30
			Array(2040422,800,1), //拳套攻击诅咒卷轴30
			Array(2044802,800,1), //拳套攻击诅咒卷轴30
			Array(2044803,800,1), //拳套攻击诅咒卷轴30
			Array(2044801,800,1), //拳套攻击诅咒卷轴30
			Array(2040401,800,1), //拳套攻击诅咒卷轴30
			Array(2040402,800,1), //拳套攻击诅咒卷轴30
			Array(2043311,800,1), //拳套攻击诅咒卷轴30
			Array(2046223,800,1), //拳套攻击诅咒卷轴30
			Array(2043302,800,1), //拳套攻击诅咒卷轴30
			Array(2040705,800,1), //拳套攻击诅咒卷轴30
			Array(2040708,800,1), //拳套攻击诅咒卷轴30
			Array(2040701,800,1), //拳套攻击诅咒卷轴30
			Array(2043212,800,1), //拳套攻击诅咒卷轴30
			Array(2043201,800,1), //拳套攻击诅咒卷轴30
			Array(2040612,800,1), //拳套攻击诅咒卷轴30
			Array(2040622,800,1), //拳套攻击诅咒卷轴30
			Array(2040625,800,1), //拳套攻击诅咒卷轴30
			Array(2040601,800,1), //拳套攻击诅咒卷轴30
			Array(2040602,800,1), //拳套攻击诅咒卷轴30
			Array(2043101,800,1), //拳套攻击诅咒卷轴30
			Array(2043102,800,1), //拳套攻击诅咒卷轴30
			Array(2044511,800,1), //拳套攻击诅咒卷轴30
			Array(2043811,800,1), //拳套攻击诅咒卷轴30
			Array(2043801,800,1), //拳套攻击诅咒卷轴30
			Array(2043802,800,1), //拳套攻击诅咒卷轴30 11
			Array(2044501,800,1), //拳套攻击诅咒卷轴30
			Array(2044502,800,1), //拳套攻击诅咒卷轴30
			Array(2046534,800,1), //拳套攻击诅咒卷轴30
			Array(2044412,800,1), //拳套攻击诅咒卷轴30
			Array(2044402,800,1), //拳套攻击诅咒卷轴30
			Array(2044401,800,1), //拳套攻击诅咒卷轴30
			Array(2040017,800,1), //拳套攻击诅咒卷轴30
			Array(2040029,800,1), //拳套攻击诅咒卷轴30
			Array(2040004,800,1), //拳套攻击诅咒卷轴30
			Array(2040005,800,1), //拳套攻击诅咒卷轴30
			Array(2040002,800,1), //拳套攻击诅咒卷轴30
			Array(2040001,800,1), //拳套攻击诅咒卷轴30
			Array(2043702,800,1), //拳套攻击诅咒卷轴30
			Array(2043701,800,1), //拳套攻击诅咒卷轴30
			Array(2043711,800,1), //拳套攻击诅咒卷轴30
			Array(2047967,800,1), //拳套攻击诅咒卷轴30
			Array(2044711,800,1), //拳套攻击诅咒卷轴30
			Array(2040301,800,1), //拳套攻击诅咒卷轴30
			Array(2040302,800,1), //拳套攻击诅咒卷轴30
			Array(2044702,800,1), //拳套攻击诅咒卷轴30
			Array(2044701,800,1), //拳套攻击诅咒卷轴30
			Array(2040317,800,1), //拳套攻击诅咒卷轴30
			Array(2040311,800,1), //拳套攻击诅咒卷轴30
			Array(2040310,800,1), //拳套攻击诅咒卷轴30
			Array(2040318,800,1), //拳套攻击诅咒卷轴30
			Array(2040323,800,1), //拳套攻击诅咒卷轴30
			Array(2044611,800,1), //拳套攻击诅咒卷轴30
			Array(2044602,800,1), //拳套攻击诅咒卷轴30
			Array(2044601,800,1), //拳套攻击诅咒卷轴30
			Array(2040206,800,1), //拳套攻击诅咒卷轴30
			Array(2040205,800,1), //拳套攻击诅咒卷轴30
			Array(2040201,800,1), //拳套攻击诅咒卷轴30
			Array(2040200,800,1), //拳套攻击诅咒卷轴30
			Array(2046891,800,1), //拳套攻击诅咒卷轴30
			Array(2044003,100,1), //拳套攻击诅咒卷轴30
			Array(2044103,100,1), //拳套攻击诅咒卷轴30
			Array(2044303,100,1), //拳套攻击诅咒卷轴30
			Array(2044203,400,1), //拳套攻击诅咒卷轴30
			Array(2043003,200,1), //拳套攻击诅咒卷轴30
			Array(2040903,200,1), //拳套攻击诅咒卷轴30
			Array(2040806,100,1), //拳套攻击诅咒卷轴30
			Array(2040507,200,1), //拳套攻击诅咒卷轴30
			Array(2040506,100,1), //拳套攻击诅咒卷轴30
			Array(2044908,200,1), //拳套攻击诅咒卷轴30
			Array(2044815,400,1), //拳套攻击诅咒卷轴30
			Array(2040403,200,1), //拳套攻击诅咒卷轴30
			Array(2043303,100,1), //拳套攻击诅咒卷轴30
			Array(2040710,600,1), //拳套攻击诅咒卷轴30
			Array(2040711,600,1), //拳套攻击诅咒卷轴30
			Array(2043203,500,1), //拳套攻击诅咒卷轴30
			Array(2040603,300,1), //拳套攻击诅咒卷轴30
			Array(2043103,400,1), //拳套攻击诅咒卷轴30
			Array(2043803,200,1), //拳套攻击诅咒卷轴30
			Array(2044503,100,1), //拳套攻击诅咒卷轴30
			Array(2044403,100,1), //拳套攻击诅咒卷轴30
			Array(2040006,100,1), //拳套攻击诅咒卷轴30
			Array(2040007,200,1), //拳套攻击诅咒卷轴30
			Array(2043703,200,1), //拳套攻击诅咒卷轴30
			Array(2040303,100,1), //拳套攻击诅咒卷轴30
			Array(2044703,100,1), //拳套攻击诅咒卷轴30
			Array(2044603,200,1), //拳套攻击诅咒卷轴30
			Array(2340000,800,1), //拳套攻击诅咒卷轴30
			Array(2022140,500,1) //拳套攻击诅咒卷轴(必成)
);

function start() {
	status = -1;
	action(1, 0, 0);
}

function action(mode, type, selection) {
	if (mode == -1) {
		cm.dispose();
	} else {
		if (mode == 0) {
			cm.dispose();
			return;
		}
		if (mode == 1)
			status++;
		else
			status--;
		if (status == 0) {
			if (cm.getNX() >= 345) {
				cm.sendYesNo("欢迎参加本次系统活动。使用点卷你可获得异想不到的卷轴！系统会随机抽取物品,是否继续使用345点卷进行抽奖？");
			} else {
				cm.sendOk("欢迎参加本次系统活动。你确定有345点卷吗？");
				cm.dispose();
			}
		} else if (status == 1){	
			var ii = net.sf.odinms.server.MapleItemInformationProvider.getInstance();
			for(var i = 1;i<=5;i++){
				if(cm.getPlayer().getInventory(net.sf.odinms.client.MapleInventoryType.getByType(i)).isFull()){
					cm.sendOk("您至少应该让所有包裹都空出一格");
					cm.dispose();
					return;
				}
			}
			var chance = Math.floor(Math.random()*1000);
			var finalitem = Array();
			for(var i = 0 ;i<item.length;i++){
				if(item[i][1] >= chance){
					finalitem.push(item[i]);
				}
			}
			if(finalitem.length != 0){
				var random = new java.util.Random();
				var finalchance = random.nextInt(finalitem.length);
				var itemId = finalitem[finalchance][0];
				var quantity = finalitem[finalchance][2];
			        if(ii.getInventoryType(itemId).getType() == 1){
			        	var toDrop = ii.randomizeStats(ii.getEquipById(itemId)).copy();
				}
				else{
				 	 var toDrop = new net.sf.odinms.client.Equip(itemId,0).copy();
				}
				net.sf.odinms.server.MapleInventoryManipulator.addFromDrop(cm.getC(), toDrop,-1);
				cm.getC().getChannelServer().getWorldInterface().broadcastMessage(null, net.sf.odinms.tools.MaplePacketCreator.getItemMega(cm.getC().getChannel(),cm.getPlayer().getName() + " : " + "从卷轴抽奖机获得！大家一起恭喜他（她）吧！！！",toDrop, true).getBytes());				
				cm.gainNX(-345);
				cm.getPlayer().saveToDB(true);
				cm.sendOk("非常感谢参加本次系统活动。多多努力。获取更多的礼物吧！");
				cm.dispose();
			} else {							
				cm.gainNX(-345);
				cm.gainItem(2022140,1);
				cm.getPlayer().saveToDB(true);
				cm.sendOk("欢迎参加本次系统活动。你什么也没抽到。给你一点安慰奖！");
				cm.dispose();
			}
		}
	}
}
